RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/**
  ******************************************************************************
  * @file    dsp2_middle2_reg.h
  * @version V1.0
  * @date    2021-02-05
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_MIDDLE2_REG_H__
#define __DSP2_MIDDLE2_REG_H__

#include "bl808.h"

/* 0x800 : BDM_1 */
#define DSP2_MIDDLE2_BDM_1_OFFSET           (0x800)
#define DSP2_MIDDLE2_BDM_EB_PRE             DSP2_MIDDLE2_BDM_EB_PRE
#define DSP2_MIDDLE2_BDM_EB_PRE_POS         (0U)
#define DSP2_MIDDLE2_BDM_EB_PRE_LEN         (1U)
#define DSP2_MIDDLE2_BDM_EB_PRE_MSK         (((1U << DSP2_MIDDLE2_BDM_EB_PRE_LEN) - 1) << DSP2_MIDDLE2_BDM_EB_PRE_POS)
#define DSP2_MIDDLE2_BDM_EB_PRE_UMSK        (~(((1U << DSP2_MIDDLE2_BDM_EB_PRE_LEN) - 1) << DSP2_MIDDLE2_BDM_EB_PRE_POS))
#define DSP2_MIDDLE2_GW_THR_PRE             DSP2_MIDDLE2_GW_THR_PRE
#define DSP2_MIDDLE2_GW_THR_PRE_POS         (8U)
#define DSP2_MIDDLE2_GW_THR_PRE_LEN         (5U)
#define DSP2_MIDDLE2_GW_THR_PRE_MSK         (((1U << DSP2_MIDDLE2_GW_THR_PRE_LEN) - 1) << DSP2_MIDDLE2_GW_THR_PRE_POS)
#define DSP2_MIDDLE2_GW_THR_PRE_UMSK        (~(((1U << DSP2_MIDDLE2_GW_THR_PRE_LEN) - 1) << DSP2_MIDDLE2_GW_THR_PRE_POS))
#define DSP2_MIDDLE2_G_SCAL_FACTOR_PRE      DSP2_MIDDLE2_G_SCAL_FACTOR_PRE
#define DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_POS  (16U)
#define DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_LEN  (9U)
#define DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_MSK  (((1U << DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_POS)
#define DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_UMSK (~(((1U << DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_G_SCAL_FACTOR_PRE_POS))

/* 0x804 : BDM_2 */
#define DSP2_MIDDLE2_BDM_2_OFFSET           (0x804)
#define DSP2_MIDDLE2_R_SCAL_FACTOR_PRE      DSP2_MIDDLE2_R_SCAL_FACTOR_PRE
#define DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_POS  (0U)
#define DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_LEN  (9U)
#define DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_MSK  (((1U << DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_POS)
#define DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_UMSK (~(((1U << DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_R_SCAL_FACTOR_PRE_POS))
#define DSP2_MIDDLE2_B_SCAL_FACTOR_PRE      DSP2_MIDDLE2_B_SCAL_FACTOR_PRE
#define DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_POS  (16U)
#define DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_LEN  (9U)
#define DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_MSK  (((1U << DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_POS)
#define DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_UMSK (~(((1U << DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_LEN) - 1) << DSP2_MIDDLE2_B_SCAL_FACTOR_PRE_POS))

/* 0x808 : BDM_3 */
#define DSP2_MIDDLE2_BDM_3_OFFSET          (0x808)
#define DSP2_MIDDLE2_NR_PROFILE10_PRE      DSP2_MIDDLE2_NR_PROFILE10_PRE
#define DSP2_MIDDLE2_NR_PROFILE10_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE10_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE10_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE10_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE10_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE10_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE10_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE10_PRE_POS))
#define DSP2_MIDDLE2_NR_PROFILE00_PRE      DSP2_MIDDLE2_NR_PROFILE00_PRE
#define DSP2_MIDDLE2_NR_PROFILE00_PRE_POS  (16U)
#define DSP2_MIDDLE2_NR_PROFILE00_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE00_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE00_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE00_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE00_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE00_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE00_PRE_POS))

/* 0x80C : BDM_4 */
#define DSP2_MIDDLE2_BDM_4_OFFSET          (0x80C)
#define DSP2_MIDDLE2_NR_PROFILE30_PRE      DSP2_MIDDLE2_NR_PROFILE30_PRE
#define DSP2_MIDDLE2_NR_PROFILE30_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE30_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE30_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE30_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE30_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE30_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE30_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE30_PRE_POS))
#define DSP2_MIDDLE2_NR_PROFILE20_PRE      DSP2_MIDDLE2_NR_PROFILE20_PRE
#define DSP2_MIDDLE2_NR_PROFILE20_PRE_POS  (16U)
#define DSP2_MIDDLE2_NR_PROFILE20_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE20_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE20_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE20_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE20_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE20_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE20_PRE_POS))

/* 0x810 : BDM_5 */
#define DSP2_MIDDLE2_BDM_5_OFFSET          (0x810)
#define DSP2_MIDDLE2_NR_PROFILE50_PRE      DSP2_MIDDLE2_NR_PROFILE50_PRE
#define DSP2_MIDDLE2_NR_PROFILE50_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE50_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE50_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE50_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE50_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE50_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE50_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE50_PRE_POS))
#define DSP2_MIDDLE2_NR_PROFILE40_PRE      DSP2_MIDDLE2_NR_PROFILE40_PRE
#define DSP2_MIDDLE2_NR_PROFILE40_PRE_POS  (16U)
#define DSP2_MIDDLE2_NR_PROFILE40_PRE_LEN  (12U)
#define DSP2_MIDDLE2_NR_PROFILE40_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE40_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE40_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE40_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE40_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE40_PRE_POS))

