RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/* 0x814 : BDM_6 */
#define DSP2_MIDDLE2_BDM_6_OFFSET          (0x814)
#define DSP2_MIDDLE2_NR_PROFILE01_PRE      DSP2_MIDDLE2_NR_PROFILE01_PRE
#define DSP2_MIDDLE2_NR_PROFILE01_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE01_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE01_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE01_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE01_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE01_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE01_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE01_PRE_POS))

/* 0x818 : BDM_7 */
#define DSP2_MIDDLE2_BDM_7_OFFSET          (0x818)
#define DSP2_MIDDLE2_NR_PROFILE11_PRE      DSP2_MIDDLE2_NR_PROFILE11_PRE
#define DSP2_MIDDLE2_NR_PROFILE11_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE11_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE11_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE11_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE11_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE11_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE11_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE11_PRE_POS))

/* 0x81C : BDM_8 */
#define DSP2_MIDDLE2_BDM_8_OFFSET          (0x81C)
#define DSP2_MIDDLE2_NR_PROFILE21_PRE      DSP2_MIDDLE2_NR_PROFILE21_PRE
#define DSP2_MIDDLE2_NR_PROFILE21_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE21_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE21_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE21_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE21_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE21_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE21_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE21_PRE_POS))

/* 0x820 : BDM_9 */
#define DSP2_MIDDLE2_BDM_9_OFFSET          (0x820)
#define DSP2_MIDDLE2_NR_PROFILE31_PRE      DSP2_MIDDLE2_NR_PROFILE31_PRE
#define DSP2_MIDDLE2_NR_PROFILE31_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE31_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE31_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE31_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE31_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE31_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE31_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE31_PRE_POS))

/* 0x824 : BDM_10 */
#define DSP2_MIDDLE2_BDM_10_OFFSET         (0x824)
#define DSP2_MIDDLE2_NR_PROFILE41_PRE      DSP2_MIDDLE2_NR_PROFILE41_PRE
#define DSP2_MIDDLE2_NR_PROFILE41_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE41_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE41_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE41_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE41_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE41_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE41_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE41_PRE_POS))

/* 0x828 : BDM_11 */
#define DSP2_MIDDLE2_BDM_11_OFFSET         (0x828)
#define DSP2_MIDDLE2_NR_PROFILE51_PRE      DSP2_MIDDLE2_NR_PROFILE51_PRE
#define DSP2_MIDDLE2_NR_PROFILE51_PRE_POS  (0U)
#define DSP2_MIDDLE2_NR_PROFILE51_PRE_LEN  (17U)
#define DSP2_MIDDLE2_NR_PROFILE51_PRE_MSK  (((1U << DSP2_MIDDLE2_NR_PROFILE51_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE51_PRE_POS)
#define DSP2_MIDDLE2_NR_PROFILE51_PRE_UMSK (~(((1U << DSP2_MIDDLE2_NR_PROFILE51_PRE_LEN) - 1) << DSP2_MIDDLE2_NR_PROFILE51_PRE_POS))

/* 0x82C : BDM_12 */
#define DSP2_MIDDLE2_BDM_12_OFFSET      (0x82C)
#define DSP2_MIDDLE2_LUMA_G_W1_PRE      DSP2_MIDDLE2_LUMA_G_W1_PRE
#define DSP2_MIDDLE2_LUMA_G_W1_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W1_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W1_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W1_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W1_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W1_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W1_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W1_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W0_PRE      DSP2_MIDDLE2_LUMA_G_W0_PRE
#define DSP2_MIDDLE2_LUMA_G_W0_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W0_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W0_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W0_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W0_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W0_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W0_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W0_PRE_POS))

/* 0x830 : BDM_13 */
#define DSP2_MIDDLE2_BDM_13_OFFSET      (0x830)
#define DSP2_MIDDLE2_LUMA_G_W3_PRE      DSP2_MIDDLE2_LUMA_G_W3_PRE
#define DSP2_MIDDLE2_LUMA_G_W3_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W3_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W3_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W3_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W3_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W3_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W3_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W3_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W2_PRE      DSP2_MIDDLE2_LUMA_G_W2_PRE
#define DSP2_MIDDLE2_LUMA_G_W2_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W2_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W2_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W2_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W2_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W2_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W2_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W2_PRE_POS))

/* 0x834 : BDM_14 */
#define DSP2_MIDDLE2_BDM_14_OFFSET      (0x834)
#define DSP2_MIDDLE2_LUMA_G_W5_PRE      DSP2_MIDDLE2_LUMA_G_W5_PRE
#define DSP2_MIDDLE2_LUMA_G_W5_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W5_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W5_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W5_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W5_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W5_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W5_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W5_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W4_PRE      DSP2_MIDDLE2_LUMA_G_W4_PRE
#define DSP2_MIDDLE2_LUMA_G_W4_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W4_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W4_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W4_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W4_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W4_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W4_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W4_PRE_POS))

/* 0x838 : BDM_15 */
#define DSP2_MIDDLE2_BDM_15_OFFSET      (0x838)
#define DSP2_MIDDLE2_LUMA_G_W7_PRE      DSP2_MIDDLE2_LUMA_G_W7_PRE
#define DSP2_MIDDLE2_LUMA_G_W7_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W7_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W7_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W7_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W7_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W7_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W7_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W7_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W6_PRE      DSP2_MIDDLE2_LUMA_G_W6_PRE
#define DSP2_MIDDLE2_LUMA_G_W6_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W6_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W6_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W6_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W6_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W6_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W6_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W6_PRE_POS))

/* 0x83C : BDM_16 */
#define DSP2_MIDDLE2_BDM_16_OFFSET      (0x83C)
#define DSP2_MIDDLE2_LUMA_G_W9_PRE      DSP2_MIDDLE2_LUMA_G_W9_PRE
#define DSP2_MIDDLE2_LUMA_G_W9_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W9_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W9_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W9_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W9_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W9_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W9_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W9_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W8_PRE      DSP2_MIDDLE2_LUMA_G_W8_PRE
#define DSP2_MIDDLE2_LUMA_G_W8_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W8_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W8_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W8_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W8_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W8_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W8_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W8_PRE_POS))

/* 0x840 : BDM_17 */
#define DSP2_MIDDLE2_BDM_17_OFFSET       (0x840)
#define DSP2_MIDDLE2_LUMA_G_W11_PRE      DSP2_MIDDLE2_LUMA_G_W11_PRE
#define DSP2_MIDDLE2_LUMA_G_W11_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W11_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W11_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W11_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W11_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W11_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W11_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W11_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W10_PRE      DSP2_MIDDLE2_LUMA_G_W10_PRE
#define DSP2_MIDDLE2_LUMA_G_W10_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W10_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W10_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W10_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W10_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W10_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W10_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W10_PRE_POS))

/* 0x844 : BDM_18 */
#define DSP2_MIDDLE2_BDM_18_OFFSET       (0x844)
#define DSP2_MIDDLE2_LUMA_G_W13_PRE      DSP2_MIDDLE2_LUMA_G_W13_PRE
#define DSP2_MIDDLE2_LUMA_G_W13_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W13_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W13_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W13_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W13_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W13_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W13_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W13_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W12_PRE      DSP2_MIDDLE2_LUMA_G_W12_PRE
#define DSP2_MIDDLE2_LUMA_G_W12_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W12_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W12_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W12_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W12_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W12_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W12_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W12_PRE_POS))

