RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/* 0x848 : BDM_19 */
#define DSP2_MIDDLE2_BDM_19_OFFSET       (0x848)
#define DSP2_MIDDLE2_LUMA_G_W15_PRE      DSP2_MIDDLE2_LUMA_G_W15_PRE
#define DSP2_MIDDLE2_LUMA_G_W15_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W15_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W15_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W15_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W15_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W15_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W15_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W15_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W14_PRE      DSP2_MIDDLE2_LUMA_G_W14_PRE
#define DSP2_MIDDLE2_LUMA_G_W14_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W14_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W14_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W14_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W14_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W14_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W14_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W14_PRE_POS))

/* 0x84C : BDM_20 */
#define DSP2_MIDDLE2_BDM_20_OFFSET       (0x84C)
#define DSP2_MIDDLE2_LUMA_G_W17_PRE      DSP2_MIDDLE2_LUMA_G_W17_PRE
#define DSP2_MIDDLE2_LUMA_G_W17_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W17_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W17_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W17_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W17_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W17_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W17_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W17_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W16_PRE      DSP2_MIDDLE2_LUMA_G_W16_PRE
#define DSP2_MIDDLE2_LUMA_G_W16_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W16_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W16_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W16_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W16_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W16_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W16_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W16_PRE_POS))

/* 0x850 : BDM_21 */
#define DSP2_MIDDLE2_BDM_21_OFFSET       (0x850)
#define DSP2_MIDDLE2_LUMA_G_W19_PRE      DSP2_MIDDLE2_LUMA_G_W19_PRE
#define DSP2_MIDDLE2_LUMA_G_W19_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W19_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W19_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W19_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W19_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W19_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W19_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W19_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W18_PRE      DSP2_MIDDLE2_LUMA_G_W18_PRE
#define DSP2_MIDDLE2_LUMA_G_W18_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W18_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W18_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W18_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W18_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W18_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W18_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W18_PRE_POS))

/* 0x854 : BDM_22 */
#define DSP2_MIDDLE2_BDM_22_OFFSET       (0x854)
#define DSP2_MIDDLE2_LUMA_G_W21_PRE      DSP2_MIDDLE2_LUMA_G_W21_PRE
#define DSP2_MIDDLE2_LUMA_G_W21_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W21_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W21_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W21_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W21_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W21_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W21_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W21_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W20_PRE      DSP2_MIDDLE2_LUMA_G_W20_PRE
#define DSP2_MIDDLE2_LUMA_G_W20_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W20_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W20_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W20_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W20_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W20_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W20_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W20_PRE_POS))

/* 0x858 : BDM_23 */
#define DSP2_MIDDLE2_BDM_23_OFFSET       (0x858)
#define DSP2_MIDDLE2_LUMA_G_W23_PRE      DSP2_MIDDLE2_LUMA_G_W23_PRE
#define DSP2_MIDDLE2_LUMA_G_W23_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W23_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W23_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W23_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W23_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W23_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W23_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W23_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W22_PRE      DSP2_MIDDLE2_LUMA_G_W22_PRE
#define DSP2_MIDDLE2_LUMA_G_W22_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W22_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W22_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W22_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W22_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W22_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W22_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W22_PRE_POS))

/* 0x85C : BDM_24 */
#define DSP2_MIDDLE2_BDM_24_OFFSET       (0x85C)
#define DSP2_MIDDLE2_LUMA_G_W25_PRE      DSP2_MIDDLE2_LUMA_G_W25_PRE
#define DSP2_MIDDLE2_LUMA_G_W25_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W25_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W25_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W25_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W25_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W25_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W25_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W25_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W24_PRE      DSP2_MIDDLE2_LUMA_G_W24_PRE
#define DSP2_MIDDLE2_LUMA_G_W24_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W24_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W24_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W24_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W24_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W24_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W24_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W24_PRE_POS))

/* 0x860 : BDM_25 */
#define DSP2_MIDDLE2_BDM_25_OFFSET       (0x860)
#define DSP2_MIDDLE2_LUMA_G_W27_PRE      DSP2_MIDDLE2_LUMA_G_W27_PRE
#define DSP2_MIDDLE2_LUMA_G_W27_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W27_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W27_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W27_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W27_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W27_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W27_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W27_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W26_PRE      DSP2_MIDDLE2_LUMA_G_W26_PRE
#define DSP2_MIDDLE2_LUMA_G_W26_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W26_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W26_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W26_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W26_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W26_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W26_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W26_PRE_POS))

