RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/* 0x864 : BDM_26 */
#define DSP2_MIDDLE2_BDM_26_OFFSET       (0x864)
#define DSP2_MIDDLE2_LUMA_G_W29_PRE      DSP2_MIDDLE2_LUMA_G_W29_PRE
#define DSP2_MIDDLE2_LUMA_G_W29_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W29_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W29_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W29_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W29_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W29_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W29_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W29_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W28_PRE      DSP2_MIDDLE2_LUMA_G_W28_PRE
#define DSP2_MIDDLE2_LUMA_G_W28_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W28_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W28_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W28_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W28_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W28_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W28_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W28_PRE_POS))

/* 0x868 : BDM_27 */
#define DSP2_MIDDLE2_BDM_27_OFFSET       (0x868)
#define DSP2_MIDDLE2_LUMA_G_W31_PRE      DSP2_MIDDLE2_LUMA_G_W31_PRE
#define DSP2_MIDDLE2_LUMA_G_W31_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_G_W31_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W31_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W31_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W31_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W31_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W31_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W31_PRE_POS))
#define DSP2_MIDDLE2_LUMA_G_W30_PRE      DSP2_MIDDLE2_LUMA_G_W30_PRE
#define DSP2_MIDDLE2_LUMA_G_W30_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_G_W30_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_G_W30_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_G_W30_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W30_PRE_POS)
#define DSP2_MIDDLE2_LUMA_G_W30_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_G_W30_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_G_W30_PRE_POS))

/* 0x870 : BDM_28 */
#define DSP2_MIDDLE2_BDM_28_OFFSET       (0x870)
#define DSP2_MIDDLE2_LUMA_BR_W1_PRE      DSP2_MIDDLE2_LUMA_BR_W1_PRE
#define DSP2_MIDDLE2_LUMA_BR_W1_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W1_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W1_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W1_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W1_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W1_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W1_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W1_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W0_PRE      DSP2_MIDDLE2_LUMA_BR_W0_PRE
#define DSP2_MIDDLE2_LUMA_BR_W0_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W0_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W0_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W0_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W0_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W0_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W0_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W0_PRE_POS))

/* 0x874 : BDM_29 */
#define DSP2_MIDDLE2_BDM_29_OFFSET       (0x874)
#define DSP2_MIDDLE2_LUMA_BR_W3_PRE      DSP2_MIDDLE2_LUMA_BR_W3_PRE
#define DSP2_MIDDLE2_LUMA_BR_W3_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W3_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W3_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W3_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W3_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W3_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W3_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W3_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W2_PRE      DSP2_MIDDLE2_LUMA_BR_W2_PRE
#define DSP2_MIDDLE2_LUMA_BR_W2_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W2_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W2_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W2_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W2_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W2_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W2_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W2_PRE_POS))

/* 0x878 : BDM_30 */
#define DSP2_MIDDLE2_BDM_30_OFFSET       (0x878)
#define DSP2_MIDDLE2_LUMA_BR_W5_PRE      DSP2_MIDDLE2_LUMA_BR_W5_PRE
#define DSP2_MIDDLE2_LUMA_BR_W5_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W5_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W5_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W5_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W5_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W5_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W5_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W5_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W4_PRE      DSP2_MIDDLE2_LUMA_BR_W4_PRE
#define DSP2_MIDDLE2_LUMA_BR_W4_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W4_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W4_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W4_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W4_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W4_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W4_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W4_PRE_POS))

/* 0x87C : BDM_31 */
#define DSP2_MIDDLE2_BDM_31_OFFSET       (0x87C)
#define DSP2_MIDDLE2_LUMA_BR_W7_PRE      DSP2_MIDDLE2_LUMA_BR_W7_PRE
#define DSP2_MIDDLE2_LUMA_BR_W7_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W7_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W7_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W7_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W7_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W7_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W7_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W7_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W6_PRE      DSP2_MIDDLE2_LUMA_BR_W6_PRE
#define DSP2_MIDDLE2_LUMA_BR_W6_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W6_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W6_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W6_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W6_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W6_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W6_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W6_PRE_POS))

/* 0x880 : BDM_32 */
#define DSP2_MIDDLE2_BDM_32_OFFSET       (0x880)
#define DSP2_MIDDLE2_LUMA_BR_W9_PRE      DSP2_MIDDLE2_LUMA_BR_W9_PRE
#define DSP2_MIDDLE2_LUMA_BR_W9_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W9_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W9_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W9_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W9_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W9_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W9_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W9_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W8_PRE      DSP2_MIDDLE2_LUMA_BR_W8_PRE
#define DSP2_MIDDLE2_LUMA_BR_W8_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W8_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W8_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W8_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W8_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W8_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W8_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W8_PRE_POS))

/* 0x884 : BDM_33 */
#define DSP2_MIDDLE2_BDM_33_OFFSET        (0x884)
#define DSP2_MIDDLE2_LUMA_BR_W11_PRE      DSP2_MIDDLE2_LUMA_BR_W11_PRE
#define DSP2_MIDDLE2_LUMA_BR_W11_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W11_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W11_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W11_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W11_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W11_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W11_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W11_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W10_PRE      DSP2_MIDDLE2_LUMA_BR_W10_PRE
#define DSP2_MIDDLE2_LUMA_BR_W10_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W10_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W10_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W10_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W10_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W10_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W10_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W10_PRE_POS))

