RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/* 0x888 : BDM_34 */
#define DSP2_MIDDLE2_BDM_34_OFFSET        (0x888)
#define DSP2_MIDDLE2_LUMA_BR_W13_PRE      DSP2_MIDDLE2_LUMA_BR_W13_PRE
#define DSP2_MIDDLE2_LUMA_BR_W13_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W13_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W13_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W13_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W13_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W13_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W13_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W13_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W12_PRE      DSP2_MIDDLE2_LUMA_BR_W12_PRE
#define DSP2_MIDDLE2_LUMA_BR_W12_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W12_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W12_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W12_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W12_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W12_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W12_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W12_PRE_POS))

/* 0x88C : BDM_35 */
#define DSP2_MIDDLE2_BDM_35_OFFSET        (0x88C)
#define DSP2_MIDDLE2_LUMA_BR_W15_PRE      DSP2_MIDDLE2_LUMA_BR_W15_PRE
#define DSP2_MIDDLE2_LUMA_BR_W15_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W15_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W15_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W15_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W15_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W15_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W15_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W15_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W14_PRE      DSP2_MIDDLE2_LUMA_BR_W14_PRE
#define DSP2_MIDDLE2_LUMA_BR_W14_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W14_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W14_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W14_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W14_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W14_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W14_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W14_PRE_POS))

/* 0x890 : BDM_36 */
#define DSP2_MIDDLE2_BDM_36_OFFSET        (0x890)
#define DSP2_MIDDLE2_LUMA_BR_W17_PRE      DSP2_MIDDLE2_LUMA_BR_W17_PRE
#define DSP2_MIDDLE2_LUMA_BR_W17_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W17_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W17_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W17_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W17_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W17_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W17_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W17_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W16_PRE      DSP2_MIDDLE2_LUMA_BR_W16_PRE
#define DSP2_MIDDLE2_LUMA_BR_W16_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W16_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W16_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W16_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W16_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W16_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W16_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W16_PRE_POS))

/* 0x894 : BDM_37 */
#define DSP2_MIDDLE2_BDM_37_OFFSET        (0x894)
#define DSP2_MIDDLE2_LUMA_BR_W19_PRE      DSP2_MIDDLE2_LUMA_BR_W19_PRE
#define DSP2_MIDDLE2_LUMA_BR_W19_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W19_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W19_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W19_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W19_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W19_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W19_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W19_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W18_PRE      DSP2_MIDDLE2_LUMA_BR_W18_PRE
#define DSP2_MIDDLE2_LUMA_BR_W18_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W18_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W18_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W18_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W18_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W18_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W18_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W18_PRE_POS))

/* 0x898 : BDM_38 */
#define DSP2_MIDDLE2_BDM_38_OFFSET        (0x898)
#define DSP2_MIDDLE2_LUMA_BR_W21_PRE      DSP2_MIDDLE2_LUMA_BR_W21_PRE
#define DSP2_MIDDLE2_LUMA_BR_W21_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W21_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W21_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W21_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W21_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W21_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W21_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W21_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W20_PRE      DSP2_MIDDLE2_LUMA_BR_W20_PRE
#define DSP2_MIDDLE2_LUMA_BR_W20_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W20_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W20_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W20_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W20_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W20_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W20_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W20_PRE_POS))

/* 0x89C : BDM_39 */
#define DSP2_MIDDLE2_BDM_39_OFFSET        (0x89C)
#define DSP2_MIDDLE2_LUMA_BR_W23_PRE      DSP2_MIDDLE2_LUMA_BR_W23_PRE
#define DSP2_MIDDLE2_LUMA_BR_W23_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W23_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W23_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W23_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W23_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W23_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W23_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W23_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W22_PRE      DSP2_MIDDLE2_LUMA_BR_W22_PRE
#define DSP2_MIDDLE2_LUMA_BR_W22_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W22_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W22_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W22_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W22_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W22_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W22_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W22_PRE_POS))

/* 0x8A0 : BDM_40 */
#define DSP2_MIDDLE2_BDM_40_OFFSET        (0x8A0)
#define DSP2_MIDDLE2_LUMA_BR_W25_PRE      DSP2_MIDDLE2_LUMA_BR_W25_PRE
#define DSP2_MIDDLE2_LUMA_BR_W25_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W25_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W25_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W25_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W25_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W25_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W25_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W25_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W24_PRE      DSP2_MIDDLE2_LUMA_BR_W24_PRE
#define DSP2_MIDDLE2_LUMA_BR_W24_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W24_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W24_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W24_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W24_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W24_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W24_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W24_PRE_POS))

