RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
/* 0x8A4 : BDM_41 */
#define DSP2_MIDDLE2_BDM_41_OFFSET        (0x8A4)
#define DSP2_MIDDLE2_LUMA_BR_W27_PRE      DSP2_MIDDLE2_LUMA_BR_W27_PRE
#define DSP2_MIDDLE2_LUMA_BR_W27_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W27_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W27_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W27_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W27_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W27_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W27_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W27_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W26_PRE      DSP2_MIDDLE2_LUMA_BR_W26_PRE
#define DSP2_MIDDLE2_LUMA_BR_W26_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W26_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W26_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W26_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W26_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W26_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W26_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W26_PRE_POS))

/* 0x8A8 : BDM_42 */
#define DSP2_MIDDLE2_BDM_42_OFFSET        (0x8A8)
#define DSP2_MIDDLE2_LUMA_BR_W29_PRE      DSP2_MIDDLE2_LUMA_BR_W29_PRE
#define DSP2_MIDDLE2_LUMA_BR_W29_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W29_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W29_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W29_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W29_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W29_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W29_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W29_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W28_PRE      DSP2_MIDDLE2_LUMA_BR_W28_PRE
#define DSP2_MIDDLE2_LUMA_BR_W28_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W28_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W28_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W28_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W28_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W28_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W28_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W28_PRE_POS))

/* 0x8AC : BDM_43 */
#define DSP2_MIDDLE2_BDM_43_OFFSET        (0x8AC)
#define DSP2_MIDDLE2_LUMA_BR_W31_PRE      DSP2_MIDDLE2_LUMA_BR_W31_PRE
#define DSP2_MIDDLE2_LUMA_BR_W31_PRE_POS  (0U)
#define DSP2_MIDDLE2_LUMA_BR_W31_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W31_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W31_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W31_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W31_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W31_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W31_PRE_POS))
#define DSP2_MIDDLE2_LUMA_BR_W30_PRE      DSP2_MIDDLE2_LUMA_BR_W30_PRE
#define DSP2_MIDDLE2_LUMA_BR_W30_PRE_POS  (16U)
#define DSP2_MIDDLE2_LUMA_BR_W30_PRE_LEN  (9U)
#define DSP2_MIDDLE2_LUMA_BR_W30_PRE_MSK  (((1U << DSP2_MIDDLE2_LUMA_BR_W30_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W30_PRE_POS)
#define DSP2_MIDDLE2_LUMA_BR_W30_PRE_UMSK (~(((1U << DSP2_MIDDLE2_LUMA_BR_W30_PRE_LEN) - 1) << DSP2_MIDDLE2_LUMA_BR_W30_PRE_POS))

/* 0x8B0 : BDM_44 */
#define DSP2_MIDDLE2_BDM_44_OFFSET     (0x8B0)
#define DSP2_MIDDLE2_G_COREW_PRE       DSP2_MIDDLE2_G_COREW_PRE
#define DSP2_MIDDLE2_G_COREW_PRE_POS   (0U)
#define DSP2_MIDDLE2_G_COREW_PRE_LEN   (8U)
#define DSP2_MIDDLE2_G_COREW_PRE_MSK   (((1U << DSP2_MIDDLE2_G_COREW_PRE_LEN) - 1) << DSP2_MIDDLE2_G_COREW_PRE_POS)
#define DSP2_MIDDLE2_G_COREW_PRE_UMSK  (~(((1U << DSP2_MIDDLE2_G_COREW_PRE_LEN) - 1) << DSP2_MIDDLE2_G_COREW_PRE_POS))
#define DSP2_MIDDLE2_BR_COREW_PRE      DSP2_MIDDLE2_BR_COREW_PRE
#define DSP2_MIDDLE2_BR_COREW_PRE_POS  (8U)
#define DSP2_MIDDLE2_BR_COREW_PRE_LEN  (8U)
#define DSP2_MIDDLE2_BR_COREW_PRE_MSK  (((1U << DSP2_MIDDLE2_BR_COREW_PRE_LEN) - 1) << DSP2_MIDDLE2_BR_COREW_PRE_POS)
#define DSP2_MIDDLE2_BR_COREW_PRE_UMSK (~(((1U << DSP2_MIDDLE2_BR_COREW_PRE_LEN) - 1) << DSP2_MIDDLE2_BR_COREW_PRE_POS))

struct dsp2_middle2_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[2048];

    /* 0x800 : BDM_1 */
    union {
        struct
        {
            uint32_t bdm_eb_pre        : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7      : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t gw_thr_pre        : 5; /* [12: 8],        r/w,        0x5 */
            uint32_t reserved_13_15    : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t g_scal_factor_pre : 9; /* [24:16],        r/w,       0x40 */
            uint32_t reserved_25_31    : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_1;

    /* 0x804 : BDM_2 */
    union {
        struct
        {
            uint32_t r_scal_factor_pre : 9; /* [ 8: 0],        r/w,       0x40 */
            uint32_t reserved_9_15     : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t b_scal_factor_pre : 9; /* [24:16],        r/w,       0x40 */
            uint32_t reserved_25_31    : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_2;

    /* 0x808 : BDM_3 */
    union {
        struct
        {
            uint32_t nr_profile10_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t nr_profile00_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_3;

    /* 0x80C : BDM_4 */
    union {
        struct
        {
            uint32_t nr_profile30_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t nr_profile20_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_4;

    /* 0x810 : BDM_5 */
    union {
        struct
        {
            uint32_t nr_profile50_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t nr_profile40_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_5;

