RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
    /* 0x814 : BDM_6 */
    union {
        struct
        {
            uint32_t nr_profile01_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_6;

    /* 0x818 : BDM_7 */
    union {
        struct
        {
            uint32_t nr_profile11_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_7;

    /* 0x81C : BDM_8 */
    union {
        struct
        {
            uint32_t nr_profile21_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_8;

    /* 0x820 : BDM_9 */
    union {
        struct
        {
            uint32_t nr_profile31_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_9;

    /* 0x824 : BDM_10 */
    union {
        struct
        {
            uint32_t nr_profile41_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_10;

    /* 0x828 : BDM_11 */
    union {
        struct
        {
            uint32_t nr_profile51_pre : 17; /* [16: 0],        r/w,        0x0 */
            uint32_t reserved_17_31   : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_11;

    /* 0x82C : BDM_12 */
    union {
        struct
        {
            uint32_t luma_g_w1_pre  : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w0_pre  : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_12;

    /* 0x830 : BDM_13 */
    union {
        struct
        {
            uint32_t luma_g_w3_pre  : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w2_pre  : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_13;

    /* 0x834 : BDM_14 */
    union {
        struct
        {
            uint32_t luma_g_w5_pre  : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w4_pre  : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_14;

    /* 0x838 : BDM_15 */
    union {
        struct
        {
            uint32_t luma_g_w7_pre  : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w6_pre  : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_15;

    /* 0x83C : BDM_16 */
    union {
        struct
        {
            uint32_t luma_g_w9_pre  : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w8_pre  : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_16;

    /* 0x840 : BDM_17 */
    union {
        struct
        {
            uint32_t luma_g_w11_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w10_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_17;

    /* 0x844 : BDM_18 */
    union {
        struct
        {
            uint32_t luma_g_w13_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w12_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_18;

    /* 0x848 : BDM_19 */
    union {
        struct
        {
            uint32_t luma_g_w15_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w14_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_19;

    /* 0x84C : BDM_20 */
    union {
        struct
        {
            uint32_t luma_g_w17_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w16_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_20;

    /* 0x850 : BDM_21 */
    union {
        struct
        {
            uint32_t luma_g_w19_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w18_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_21;

    /* 0x854 : BDM_22 */
    union {
        struct
        {
            uint32_t luma_g_w21_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w20_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_22;

    /* 0x858 : BDM_23 */
    union {
        struct
        {
            uint32_t luma_g_w23_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w22_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_23;

