RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
    /* 0x85C : BDM_24 */
    union {
        struct
        {
            uint32_t luma_g_w25_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w24_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_24;

    /* 0x860 : BDM_25 */
    union {
        struct
        {
            uint32_t luma_g_w27_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w26_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_25;

    /* 0x864 : BDM_26 */
    union {
        struct
        {
            uint32_t luma_g_w29_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w28_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_26;

    /* 0x868 : BDM_27 */
    union {
        struct
        {
            uint32_t luma_g_w31_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_g_w30_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_27;

    /* 0x86c  reserved */
    uint8_t RESERVED0x86c[4];

    /* 0x870 : BDM_28 */
    union {
        struct
        {
            uint32_t luma_br_w1_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w0_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_28;

    /* 0x874 : BDM_29 */
    union {
        struct
        {
            uint32_t luma_br_w3_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w2_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_29;

    /* 0x878 : BDM_30 */
    union {
        struct
        {
            uint32_t luma_br_w5_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w4_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_30;

    /* 0x87C : BDM_31 */
    union {
        struct
        {
            uint32_t luma_br_w7_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w6_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_31;

    /* 0x880 : BDM_32 */
    union {
        struct
        {
            uint32_t luma_br_w9_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w8_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_32;

    /* 0x884 : BDM_33 */
    union {
        struct
        {
            uint32_t luma_br_w11_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w10_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_33;

    /* 0x888 : BDM_34 */
    union {
        struct
        {
            uint32_t luma_br_w13_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w12_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_34;

    /* 0x88C : BDM_35 */
    union {
        struct
        {
            uint32_t luma_br_w15_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w14_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_35;

    /* 0x890 : BDM_36 */
    union {
        struct
        {
            uint32_t luma_br_w17_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w16_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_36;

    /* 0x894 : BDM_37 */
    union {
        struct
        {
            uint32_t luma_br_w19_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w18_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_37;

    /* 0x898 : BDM_38 */
    union {
        struct
        {
            uint32_t luma_br_w21_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w20_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_38;

