RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle2_reg.h
    /* 0x89C : BDM_39 */
    union {
        struct
        {
            uint32_t luma_br_w23_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w22_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_39;

    /* 0x8A0 : BDM_40 */
    union {
        struct
        {
            uint32_t luma_br_w25_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w24_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_40;

    /* 0x8A4 : BDM_41 */
    union {
        struct
        {
            uint32_t luma_br_w27_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w26_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_41;

    /* 0x8A8 : BDM_42 */
    union {
        struct
        {
            uint32_t luma_br_w29_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w28_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_42;

    /* 0x8AC : BDM_43 */
    union {
        struct
        {
            uint32_t luma_br_w31_pre : 9; /* [ 8: 0],        r/w,       0x80 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t luma_br_w30_pre : 9; /* [24:16],        r/w,       0x80 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_43;

    /* 0x8B0 : BDM_44 */
    union {
        struct
        {
            uint32_t g_corew_pre    : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t br_corew_pre   : 8;  /* [15: 8],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BDM_44;
};

typedef volatile struct dsp2_middle2_reg dsp2_middle2_reg_t;

#endif /* __DSP2_MIDDLE2_REG_H__ */
